## Terraform Plan - beta

#### Terraform Format and Style ``
#### Terraform Initialization ``
#### Terraform Validation ``
#### Terraform Plan -lock=false `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_lambda_permission.allow_s3_beta[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "allow_s3_beta" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "rekognition-beta-handler"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "s3.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowS3InvokeBeta"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # aws_lambda_permission.allow_s3_prod[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "allow_s3_prod" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "rekognition-prod-handler"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "s3.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = "AllowS3InvokeProd"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # aws_s3_bucket_notification.bucket_notifications[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_notification" "bucket_notifications" {
      [32m+[0m[0m bucket      = (known after apply)
      [32m+[0m[0m eventbridge = false
      [32m+[0m[0m id          = (known after apply)

      [32m+[0m[0m lambda_function {
          [32m+[0m[0m events              = [
              [32m+[0m[0m "s3:ObjectCreated:*",
            ]
          [32m+[0m[0m filter_prefix       = "rekognition-input/beta/"
          [32m+[0m[0m id                  = "beta-trigger"
          [32m+[0m[0m lambda_function_arn = (known after apply)
        }
      [32m+[0m[0m lambda_function {
          [32m+[0m[0m events              = [
              [32m+[0m[0m "s3:ObjectCreated:*",
            ]
          [32m+[0m[0m filter_prefix       = "rekognition-input/prod/"
          [32m+[0m[0m id                  = "prod-trigger"
          [32m+[0m[0m lambda_function_arn = (known after apply)
        }
    }

[1m  # random_string.suffix[0m will be created
[0m  [32m+[0m[0m resource "random_string" "suffix" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 8
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.dynamodb.aws_dynamodb_table.beta_results[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "beta_results" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m billing_mode     = "PAY_PER_REQUEST"
      [32m+[0m[0m hash_key         = "filename"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "beta_results"
      [32m+[0m[0m range_key        = "timestamp"
      [32m+[0m[0m read_capacity    = (known after apply)
      [32m+[0m[0m stream_arn       = (known after apply)
      [32m+[0m[0m stream_label     = (known after apply)
      [32m+[0m[0m stream_view_type = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-beta-results"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-beta-results"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m write_capacity   = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "branch"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "filename"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "timestamp"
          [32m+[0m[0m type = "S"
        }

      [32m+[0m[0m global_secondary_index {
          [32m+[0m[0m hash_key           = "branch"
          [32m+[0m[0m name               = "BranchIndex"
          [32m+[0m[0m non_key_attributes = []
          [32m+[0m[0m projection_type    = "ALL"
          [32m+[0m[0m range_key          = "timestamp"
          [32m+[0m[0m read_capacity      = (known after apply)
          [32m+[0m[0m write_capacity     = (known after apply)
        }

      [32m+[0m[0m point_in_time_recovery {
          [32m+[0m[0m enabled                 = true
          [32m+[0m[0m recovery_period_in_days = (known after apply)
        }

      [32m+[0m[0m server_side_encryption {
          [32m+[0m[0m enabled     = false
          [32m+[0m[0m kms_key_arn = (known after apply)
        }

      [32m+[0m[0m ttl {
          [32m+[0m[0m attribute_name = "ttl"
          [32m+[0m[0m enabled        = true
        }
    }

[1m  # module.dynamodb.aws_dynamodb_table.prod_results[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "prod_results" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m billing_mode     = "PAY_PER_REQUEST"
      [32m+[0m[0m hash_key         = "filename"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "prod_results"
      [32m+[0m[0m range_key        = "timestamp"
      [32m+[0m[0m read_capacity    = (known after apply)
      [32m+[0m[0m stream_arn       = (known after apply)
      [32m+[0m[0m stream_label     = (known after apply)
      [32m+[0m[0m stream_view_type = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-prod-results"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-prod-results"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m write_capacity   = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "branch"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "filename"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "timestamp"
          [32m+[0m[0m type = "S"
        }

      [32m+[0m[0m global_secondary_index {
          [32m+[0m[0m hash_key           = "branch"
          [32m+[0m[0m name               = "BranchIndex"
          [32m+[0m[0m non_key_attributes = []
          [32m+[0m[0m projection_type    = "ALL"
          [32m+[0m[0m range_key          = "timestamp"
          [32m+[0m[0m read_capacity      = (known after apply)
          [32m+[0m[0m write_capacity     = (known after apply)
        }

      [32m+[0m[0m point_in_time_recovery {
          [32m+[0m[0m enabled                 = true
          [32m+[0m[0m recovery_period_in_days = (known after apply)
        }

      [32m+[0m[0m server_side_encryption {
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m kms_key_arn = (known after apply)
        }

      [32m+[0m[0m ttl {
          [32m+[0m[0m attribute_name = "ttl"
          [32m+[0m[0m enabled        = true
        }
    }

[1m  # module.iam.aws_iam_access_key.github_actions[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_access_key" "github_actions" {
      [32m+[0m[0m create_date                    = (known after apply)
      [32m+[0m[0m encrypted_secret               = (known after apply)
      [32m+[0m[0m encrypted_ses_smtp_password_v4 = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m key_fingerprint                = (known after apply)
      [32m+[0m[0m secret                         = (sensitive value)
      [32m+[0m[0m ses_smtp_password_v4           = (sensitive value)
      [32m+[0m[0m status                         = "Active"
      [32m+[0m[0m user                           = "pixel-learning-github-actions-user"
    }

[1m  # module.iam.aws_iam_role.lambda_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "pixel-learning-rekognition-lambda-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-lambda-role"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-lambda-role"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.iam.aws_iam_role_policy.dynamodb_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "dynamodb_policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "pixel-learning-lambda-dynamodb-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m role        = (known after apply)
    }

[1m  # module.iam.aws_iam_role_policy.rekognition_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "rekognition_policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "pixel-learning-lambda-rekognition-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "rekognition:DetectLabels",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m role        = (known after apply)
    }

[1m  # module.iam.aws_iam_role_policy.s3_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "s3_policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "pixel-learning-lambda-s3-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m role        = (known after apply)
    }

[1m  # module.iam.aws_iam_role_policy_attachment.lambda_basic_execution[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      [32m+[0m[0m role       = "pixel-learning-rekognition-lambda-role"
    }

[1m  # module.iam.aws_iam_user.github_actions[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_user" "github_actions" {
      [32m+[0m[0m arn           = (known after apply)
      [32m+[0m[0m force_destroy = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m name          = "pixel-learning-github-actions-user"
      [32m+[0m[0m path          = "/"
      [32m+[0m[0m tags          = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-github-actions-user"
        }
      [32m+[0m[0m tags_all      = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-github-actions-user"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m unique_id     = (known after apply)
    }

[1m  # module.iam.aws_iam_user_policy.github_actions_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_user_policy" "github_actions_policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "pixel-learning-github-actions-policy"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m user        = "pixel-learning-github-actions-user"
    }

[1m  # module.lambda.data.archive_file.lambda_zip[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "archive_file" "lambda_zip" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m output_base64sha256 = (known after apply)
      [32m+[0m[0m output_base64sha512 = (known after apply)
      [32m+[0m[0m output_md5          = (known after apply)
      [32m+[0m[0m output_path         = "modules/lambda/lambda_function.zip"
      [32m+[0m[0m output_sha          = (known after apply)
      [32m+[0m[0m output_sha256       = (known after apply)
      [32m+[0m[0m output_sha512       = (known after apply)
      [32m+[0m[0m output_size         = (known after apply)
      [32m+[0m[0m source_dir          = "./../lambda"
      [32m+[0m[0m type                = "zip"
    }

[1m  # module.lambda.aws_cloudwatch_log_group.beta[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "beta" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/rekognition-beta-handler"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 14
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-beta-logs"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-beta-logs"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
    }

[1m  # module.lambda.aws_cloudwatch_log_group.prod[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "prod" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/rekognition-prod-handler"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 30
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "prod"
          [32m+[0m[0m "Name"        = "pixel-learning-prod-logs"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "prod"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-prod-logs"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
    }

[1m  # module.lambda.aws_lambda_function.beta[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "beta" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m filename                       = "modules/lambda/lambda_function.zip"
      [32m+[0m[0m function_name                  = "rekognition-beta-handler"
      [32m+[0m[0m handler                        = "rekognition_handler.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 512
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.11"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-beta-handler"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-beta-handler"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m timeout                        = 60
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "DYNAMODB_TABLE" = "beta_results"
              [32m+[0m[0m "ENVIRONMENT"    = "beta"
              [32m+[0m[0m "MAX_LABELS"     = "10"
              [32m+[0m[0m "MIN_CONFIDENCE" = "70.0"
            }
        }
    }

[1m  # module.lambda.aws_lambda_function.prod[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "prod" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m filename                       = "modules/lambda/lambda_function.zip"
      [32m+[0m[0m function_name                  = "rekognition-prod-handler"
      [32m+[0m[0m handler                        = "rekognition_handler.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 512
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = false
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.11"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment" = "prod"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-prod-handler"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment" = "prod"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-prod-handler"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m timeout                        = 60
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "DYNAMODB_TABLE" = "prod_results"
              [32m+[0m[0m "ENVIRONMENT"    = "prod"
              [32m+[0m[0m "MAX_LABELS"     = "10"
              [32m+[0m[0m "MIN_CONFIDENCE" = "70.0"
            }
        }
    }

[1m  # module.lambda.aws_lambda_function_url.beta[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function_url" "beta" {
      [32m+[0m[0m authorization_type = "NONE"
      [32m+[0m[0m function_arn       = (known after apply)
      [32m+[0m[0m function_name      = "rekognition-beta-handler"
      [32m+[0m[0m function_url       = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m invoke_mode        = "BUFFERED"
      [32m+[0m[0m url_id             = (known after apply)

      [32m+[0m[0m cors {
          [32m+[0m[0m allow_methods = [
              [32m+[0m[0m "POST",
            ]
          [32m+[0m[0m allow_origins = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m max_age       = 86400
        }
    }

[1m  # module.lambda.aws_lambda_function_url.prod[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function_url" "prod" {
      [32m+[0m[0m authorization_type = "NONE"
      [32m+[0m[0m function_arn       = (known after apply)
      [32m+[0m[0m function_name      = "rekognition-prod-handler"
      [32m+[0m[0m function_url       = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m invoke_mode        = "BUFFERED"
      [32m+[0m[0m url_id             = (known after apply)

      [32m+[0m[0m cors {
          [32m+[0m[0m allow_methods = [
              [32m+[0m[0m "POST",
            ]
          [32m+[0m[0m allow_origins = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m max_age       = 86400
        }
    }

[1m  # module.s3.aws_s3_bucket.images[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "images" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = (known after apply)
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-images"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "beta"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "pixel-learning-rekognition-images"
          [32m+[0m[0m "Project"     = "PixelLearning-Rekognition"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
    }

[1m  # module.s3.aws_s3_bucket_lifecycle_configuration.images[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_lifecycle_configuration" "images" {
      [32m+[0m[0m bucket                                 = (known after apply)
      [32m+[0m[0m expected_bucket_owner                  = (known after apply)
      [32m+[0m[0m id                                     = (known after apply)
      [32m+[0m[0m transition_default_minimum_object_size = "all_storage_classes_128K"

      [32m+[0m[0m rule {
          [32m+[0m[0m id     = "delete-old-images"
          [32m+[0m[0m status = "Enabled"

          [32m+[0m[0m expiration {
              [32m+[0m[0m days                         = 90
              [32m+[0m[0m expired_object_delete_marker = false
            }

          [32m+[0m[0m noncurrent_version_expiration {
              [32m+[0m[0m noncurrent_days = 30
            }
        }
    }

[1m  # module.s3.aws_s3_bucket_public_access_block.images[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "images" {
      [32m+[0m[0m block_public_acls       = true
      [32m+[0m[0m block_public_policy     = true
      [32m+[0m[0m bucket                  = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_public_acls      = true
      [32m+[0m[0m restrict_public_buckets = true
    }

[1m  # module.s3.aws_s3_bucket_server_side_encryption_configuration.images[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_server_side_encryption_configuration" "images" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m rule {
          [32m+[0m[0m apply_server_side_encryption_by_default {
              [32m+[0m[0m sse_algorithm = "AES256"
            }
        }
    }

[1m  # module.s3.aws_s3_bucket_versioning.images[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "images" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m versioning_configuration {
          [32m+[0m[0m mfa_delete = (known after apply)
          [32m+[0m[0m status     = "Enabled"
        }
    }

[1mPlan:[0m 25 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m dynamodb_beta_table_name  = "beta_results"
  [32m+[0m[0m dynamodb_prod_table_name  = "prod_results"
  [32m+[0m[0m github_actions_setup      = {
      [32m+[0m[0m AWS_REGION          = "us-east-1"
      [32m+[0m[0m DYNAMODB_TABLE_BETA = "beta_results"
      [32m+[0m[0m DYNAMODB_TABLE_PROD = "prod_results"
      [32m+[0m[0m S3_BUCKET           = (known after apply)
    }
  [32m+[0m[0m lambda_beta_function_arn  = (known after apply)
  [32m+[0m[0m lambda_beta_function_name = "rekognition-beta-handler"
  [32m+[0m[0m lambda_prod_function_arn  = (known after apply)
  [32m+[0m[0m lambda_prod_function_name = "rekognition-prod-handler"
  [32m+[0m[0m lambda_role_arn           = (known after apply)
  [32m+[0m[0m s3_bucket_arn             = (known after apply)
  [32m+[0m[0m s3_bucket_name            = (known after apply)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mInvalid Attribute Combination[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.s3.aws_s3_bucket_lifecycle_configuration.images,
[33m│[0m [0m  on modules/s3/main.tf line 42, in resource "aws_s3_bucket_lifecycle_configuration" "images":
[33m│[0m [0m  42: resource "aws_s3_bucket_lifecycle_configuration" "images" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mNo attribute specified when one (and only one) of
[33m│[0m [0m[rule[0].filter,rule[0].prefix] is required
[33m│[0m [0m
[33m│[0m [0mThis will be an error in a future version of the provider
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @shehuj, Action: `pull_request`, Environment: `beta`*
